Revit 2026 API

# BooleanOperationsUtils Class

---

These utilities are applicable for the geometry created by GeometryCreationUtilities and the geometry of Revit model.

SystemObject Autodesk.Revit.DBBooleanOperationsUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BooleanOperationsUtils : IDisposable
```
```vb
Public Class BooleanOperationsUtils
	Implements IDisposable
```
```cpp
public ref class BooleanOperationsUtils : IDisposable
```
```fsharp
type BooleanOperationsUtils =
    class
        interface IDisposable
    end
```

The BooleanOperationsUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | CutWithHalfSpace | Creates a new Solid which is the intersection of the input Solid with the half-space on the positive side of the given Plane. The positive side of the plane is the side to which Plane.Normal points. |
|  | CutWithHalfSpaceModifyingOriginalSolid | Modifies the input Solid preserving only the volume on the positive side of the given Plane. The positive side of the plane is the side to which Plane.Normal points. |
|  | Dispose | Releases all resources used by the BooleanOperationsUtils |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | ExecuteBooleanOperation | Perform a boolean geometric operation between two solids, and return a new solid to represent the result. |
|  | ExecuteBooleanOperationModifyingOriginalSolid | Perform a boolean geometric operation between two solids, and modify the original solid to represent the result. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace